# Mentorship Sessions Data Optimization for Rewards Program Evaluation

## Task 1 : Data Cleaning

In [1]:
# Importing relevant libraries
import pandas as pd
import numpy as np

In [2]:
# Loading the Data set
rewards_data = pd.read_excel("_Data Sets Reward_Program_Assignment_Input_v6 - TA.xlsx", parse_dates=True)
rewards_data.head()

,UID,Mentor_ID,Mentor_Name,Mentee_Name,Session_Number,Session_Duration_Min,Job_Info_Completed,Session_Date,Points_Awarded
0,2001.0,1003.0,Sarah Clark,Bob Brown,1.0,40.0,Yes,2023-01-01,NaN
1,2002.0,1003.0,Emily Davis,Carol White,2.0,30.0,Yes,2023-01-08,NaN
2,2003.0,1005.0,James Wilson,Jane Smith,2.0,40.0,Yes,2023-01-15,NaN
3,4.0,1005.0,David Thompson,NaN,2.0,50.0,Yes,2023-01-22,NaN
4,2001.0,1004.0,Emily Davis,Bob Brown,1.0,30.0,No,2023-01-29,NaN

In [3]:
# Checking for duplicated records
duplicate_rows = rewards_data[rewards_data.duplicated()]

# Print the number of duplicate rows
print(f"Number of duplicate rows: {len(duplicate_rows)}")

# Display the duplicate rows
print("Duplicate Rows:")
print(duplicate_rows)

Number of duplicate rows: 0
Duplicate Rows:
Empty DataFrame
Columns: [UID, Mentor_ID, Mentor_Name, Mentee_Name, Session_Number, Session_Duration_Min, Job_Info_Completed, Session_Date, Points_Awarded]
Index: []

In [4]:
rewards_data.shape

(109, 9)

In [5]:
# Checking for nulls
rewards_data.isnull().sum()

UID                       1
Mentor_ID                 1
Mentor_Name               0
Mentee_Name               2
Session_Number            1
Session_Duration_Min      2
Job_Info_Completed        1
Session_Date              1
Points_Awarded          109
dtype: int64

In [6]:
# Dropping null values excluding those in 'Points Awarded' column

columns_to_exclude = ['Points_Awarded']
rewards_data_cleaned = rewards_data.dropna(subset=[col for col in rewards_data.columns if col not in columns_to_exclude])

print(rewards_data_cleaned.isnull().sum())

rewards_data_cleaned.head()

UID                       0
Mentor_ID                 0
Mentor_Name               0
Mentee_Name               0
Session_Number            0
Session_Duration_Min      0
Job_Info_Completed        0
Session_Date              0
Points_Awarded          106
dtype: int64

,UID,Mentor_ID,Mentor_Name,Mentee_Name,Session_Number,Session_Duration_Min,Job_Info_Completed,Session_Date,Points_Awarded
0,2001.0,1003.0,Sarah Clark,Bob Brown,1.0,40.0,Yes,2023-01-01,NaN
1,2002.0,1003.0,Emily Davis,Carol White,2.0,30.0,Yes,2023-01-08,NaN
2,2003.0,1005.0,James Wilson,Jane Smith,2.0,40.0,Yes,2023-01-15,NaN
4,2001.0,1004.0,Emily Davis,Bob Brown,1.0,30.0,No,2023-01-29,NaN
5,2003.0,1002.0,David Thompson,Jane Smith,2.0,50.0,No,2023-02-05,NaN

In [7]:
# Dropping UID and Mentor_ID columns

rewards_data_cleaned = rewards_data_cleaned.drop('UID', axis=1)
rewards_data_cleaned = rewards_data_cleaned.drop('Mentor_ID', axis=1)

In [8]:
rewards_data_cleaned.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 106 entries, 0 to 108
Data columns (total 7 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Mentor_Name           106 non-null    object
 1   Mentee_Name           106 non-null    object
 2   Session_Number        106 non-null    float64
 3   Session_Duration_Min  106 non-null    float64
 4   Job_Info_Completed    106 non-null    object
 5   Session_Date          106 non-null    object
 6   Points_Awarded        0 non-null      float64
dtypes: float64(3), object(4)
memory usage: 6.6+ KB

In [9]:
# Assigning appropriate datatypes to various columns

rewards_data_cleaned['Mentor_Name'] = rewards_data_cleaned['Mentor_Name'].astype(str)
rewards_data_cleaned['Mentee_Name'] = rewards_data_cleaned['Mentee_Name'].astype(str)
rewards_data_cleaned['Session_Number'] = rewards_data_cleaned['Session_Number'].round().astype(int)
rewards_data_cleaned['Session_Duration_Min'] = rewards_data_cleaned['Session_Duration_Min'].round().astype(int)
rewards_data_cleaned['Session_Date'] = pd.to_datetime(rewards_data_cleaned['Session_Date'])

rewards_data_cleaned.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 106 entries, 0 to 108
Data columns (total 7 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Mentor_Name           106 non-null    object
 1   Mentee_Name           106 non-null    object
 2   Session_Number        106 non-null    int32
 3   Session_Duration_Min  106 non-null    int32
 4   Job_Info_Completed    106 non-null    object
 5   Session_Date          106 non-null    datetime64[ns]
 6   Points_Awarded        0 non-null      float64
dtypes: datetime64[ns](1), float64(1), int32(2), object(3)
memory usage: 5.8+ KB

In [10]:
rewards_data_cleaned.head()

,Mentor_Name,Mentee_Name,Session_Number,Session_Duration_Min,Job_Info_Completed,Session_Date,Points_Awarded
0,Sarah Clark,Bob Brown,1,40,Yes,2023-01-01,NaN
1,Emily Davis,Carol White,2,30,Yes,2023-01-08,NaN
2,James Wilson,Jane Smith,2,40,Yes,2023-01-15,NaN
4,Emily Davis,Bob Brown,1,30,No,2023-01-29,NaN
5,David Thompson,Jane Smith,2,50,No,2023-02-05,NaN

In [11]:
# Creating a new column with uniqueIDs for each Mentor

rewards_data_cleaned['Mentor_Unique_ID'] = rewards_data_cleaned.groupby('Mentor_Name').ngroup() + 1
print(rewards_data_cleaned.head())

      Mentor_Name  Mentee_Name  Session_Number  Session_Duration_Min  \
0     Sarah Clark    Bob Brown               1                    40
1     Emily Davis  Carol White               2                    30
2    James Wilson   Jane Smith               2                    40
4     Emily Davis    Bob Brown               1                    30
5  David Thompson   Jane Smith               2                    50

  Job_Info_Completed Session_Date  Points_Awarded  Mentor_Unique_ID
0                Yes   2023-01-01             NaN                 5
1                Yes   2023-01-08             NaN                 2
2                Yes   2023-01-15             NaN                 3
4                 No   2023-01-29             NaN                 2
5                 No   2023-02-05             NaN                 1

In [12]:
# Creating a new column with uniqueIDs for each Mentee

rewards_data_cleaned['Mentee_Unique_ID'] = rewards_data_cleaned.groupby('Mentee_Name').ngroup() + 1
print(rewards_data_cleaned.head())

      Mentor_Name  Mentee_Name  Session_Number  Session_Duration_Min  \
0     Sarah Clark    Bob Brown               1                    40
1     Emily Davis  Carol White               2                    30
2    James Wilson   Jane Smith               2                    40
4     Emily Davis    Bob Brown               1                    30
5  David Thompson   Jane Smith               2                    50

  Job_Info_Completed Session_Date  Points_Awarded  Mentor_Unique_ID  \
0                Yes   2023-01-01             NaN                 5
1                Yes   2023-01-08             NaN                 2
2                Yes   2023-01-15             NaN                 3
4                 No   2023-01-29             NaN                 2
5                 No   2023-02-05             NaN                 1

   Mentee_Unique_ID
0                 2
1                 3
2                 4
4                 2
5                 4

In [13]:
# Creating a uniqueID relating each Mentor to a Mentee

rewards_data_cleaned['Unique_ID'] = rewards_data_cleaned['Mentor_Unique_ID'].astype(str) + '_' + rewards_data_cleaned['Mentee_Unique_ID'].astype(str)
print(rewards_data_cleaned.head())

      Mentor_Name  Mentee_Name  Session_Number  Session_Duration_Min  \
0     Sarah Clark    Bob Brown               1                    40
1     Emily Davis  Carol White               2                    30
2    James Wilson   Jane Smith               2                    40
4     Emily Davis    Bob Brown               1                    30
5  David Thompson   Jane Smith               2                    50

  Job_Info_Completed Session_Date  Points_Awarded  Mentor_Unique_ID  \
0                Yes   2023-01-01             NaN                 5
1                Yes   2023-01-08             NaN                 2
2                Yes   2023-01-15             NaN                 3
4                 No   2023-01-29             NaN                 2
5                 No   2023-02-05             NaN                 1

   Mentee_Unique_ID Unique_ID
0                 2       5_2
1                 3       2_3
2                 4       3_4
4                 2       2_2
5                 4       1_4

In [14]:
# Exploring the descriptive statistics of the variables
rewards_data_cleaned.describe()

,Session_Number,Session_Duration_Min,Points_Awarded,Mentor_Unique_ID,Mentee_Unique_ID
count,106.000000,106.000000,0.0,106.000000,106.000000
mean,1.481132,32.830189,NaN,2.915094,2.867925
std,0.502017,10.757475,NaN,1.374031,1.295233
min,1.000000,20.000000,NaN,1.000000,1.000000
25%,1.000000,20.000000,NaN,2.000000,2.000000
50%,1.000000,30.000000,NaN,3.000000,3.000000
75%,2.000000,40.000000,NaN,4.000000,4.000000
max,2.000000,50.000000,NaN,5.000000,5.000000

In [15]:
# Export cleaned dataset in Excel format
rewards_data_cleaned.to_excel('cleaned_rewards_data.xlsx', index=False)

### Task 2: Legacy Point Allocation

In [16]:
# Assigning initial points for signing up (250 points)
rewards_data_cleaned['Signup_Points'] = 250

# Allocating 1000 points for mentors who have mentored at least 2 different mentees
mentee_count = rewards_data_cleaned.groupby('Mentor_Unique_ID')['Mentee_Name'].nunique()
mentors_with_two_mentees = mentee_count[mentee_count >= 2].index
rewards_data_cleaned['Two_Mentees_Points'] = rewards_data_cleaned['Mentor_Unique_ID'].apply(lambda x: 1000 if x in mentors_with_two_mentees else 0)

# Allocating 500 points for mentoring the same mentee for two sessions, meeting criteria
# a. Sessions must be >= 30 minutes and
# b. At least one session must have job info completed ("Yes")

def allocate_points(group):
    if len(group) >= 2:
        if all(group['Session_Duration_Min'] >= 30) and any(group['Job_Info_Completed'] == 'Yes'):
            return 500
    return 0

mentee_group = rewards_data_cleaned.groupby(['Mentor_Unique_ID', 'Mentee_Name']).apply(allocate_points).reset_index(name='Mentorship_Points')

# Merging the mentorship points back to the main DataFrame
rewards_data_cleaned = pd.merge(rewards_data_cleaned, mentee_group, on=['Mentor_Unique_ID', 'Mentee_Name'], how='left')

# Calculating Total Points for each row
rewards_data_cleaned['Total_Points'] = rewards_data_cleaned['Signup_Points'] + rewards_data_cleaned['Two_Mentees_Points'] + rewards_data_cleaned['Mentorship_Points']

rewards_data_cleaned[['Unique_ID','Signup_Points', 'Two_Mentees_Points', 'Mentorship_Points', 'Total_Points']]

,Unique_ID,Signup_Points,Two_Mentees_Points,Mentorship_Points,Total_Points
0,5_2,250,1000,0,1250
1,2_3,250,1000,0,1250
2,3_4,250,1000,0,1250
3,2_2,250,1000,500,1750
4,1_4,250,1000,0,1250
...,...,...,...,...,...
101,4_3,250,1000,0,1250
102,4_1,250,1000,0,1250
103,4_4,250,1000,500,1750
104,4_3,250,1000,0,1250
105,4_4,250,1000,500,1750

In [17]:
rewards_data_cleaned.to_excel('Mentor_Points_Allocation_Final.xlsx', index=False)